Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/atdf/ATSAME70N19.atdf
        <register caption="Transmit Data Register" name="SPI_TDR" offset="0x0C" rw="W" size="4">
          <bitfield caption="Transmit Data" mask="0x0000FFFF" name="TD"/>
          <bitfield caption="Peripheral Chip Select" mask="0x000F0000" name="PCS"/>
          <bitfield caption="Last Transfer" mask="0x01000000" name="LASTXFER"/>
        </register>
        <register caption="Status Register" name="SPI_SR" offset="0x10" rw="R" size="4">
          <bitfield caption="Receive Data Register Full (cleared by reading SPI_RDR)" mask="0x00000001" name="RDRF"/>
          <bitfield caption="Transmit Data Register Empty (cleared by writing SPI_TDR)" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error (cleared on read)" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Status (cleared on read)" mask="0x00000008" name="OVRES"/>
          <bitfield caption="NSS Rising (cleared on read)" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty (cleared by writing SPI_TDR)" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Status (Slave mode only) (cleared on read)" mask="0x00000400" name="UNDES"/>
          <bitfield caption="SPI Enable Status" mask="0x00010000" name="SPIENS"/>
        </register>
        <register caption="Interrupt Enable Register" name="SPI_IER" offset="0x14" rw="W" size="4" atomic-op="set:SPI_IMR">
          <bitfield caption="Receive Data Register Full Interrupt Enable" mask="0x00000001" name="RDRF"/>
          <bitfield caption="SPI Transmit Data Register Empty Interrupt Enable" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error Interrupt Enable" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000008" name="OVRES"/>
          <bitfield caption="NSS Rising Interrupt Enable" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty Enable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Interrupt Enable" mask="0x00000400" name="UNDES"/>
        </register>
        <register caption="Interrupt Disable Register" name="SPI_IDR" offset="0x18" rw="W" size="4" atomic-op="clear:SPI_IMR">
          <bitfield caption="Receive Data Register Full Interrupt Disable" mask="0x00000001" name="RDRF"/>
          <bitfield caption="SPI Transmit Data Register Empty Interrupt Disable" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error Interrupt Disable" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000008" name="OVRES"/>
          <bitfield caption="NSS Rising Interrupt Disable" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty Disable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Interrupt Disable" mask="0x00000400" name="UNDES"/>
        </register>
        <register caption="Interrupt Mask Register" name="SPI_IMR" offset="0x1C" rw="R" size="4" atomic-op="read:SPI_IMR">
          <bitfield caption="Receive Data Register Full Interrupt Mask" mask="0x00000001" name="RDRF"/>
          <bitfield caption="SPI Transmit Data Register Empty Interrupt Mask" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error Interrupt Mask" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000008" name="OVRES"/>
          <bitfield caption="NSS Rising Interrupt Mask" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty Mask" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Interrupt Mask" mask="0x00000400" name="UNDES"/>
        </register>
        <register caption="Chip Select Register 0" name="SPI_CSR" offset="0x30" rw="RW" size="4" count="4">
          <bitfield caption="Clock Polarity" mask="0x00000001" name="CPOL"/>
          <bitfield caption="Clock Phase" mask="0x00000002" name="NCPHA"/>
          <bitfield caption="Chip Select Not Active After Transfer (Ignored if CSAAT = 1)" mask="0x00000004" name="CSNAAT"/>
          <bitfield caption="Chip Select Active After Transfer" mask="0x00000008" name="CSAAT"/>
          <bitfield caption="Bits Per Transfer" mask="0x000000F0" name="BITS" values="SPI_CSR__BITS"/>
          <bitfield caption="Serial Clock Bit Rate" mask="0x0000FF00" name="SCBR"/>
          <bitfield caption="Delay Before SPCK" mask="0x00FF0000" name="DLYBS"/>
          <bitfield caption="Delay Between Consecutive Transfers" mask="0xFF000000" name="DLYBCT"/>
        </register>
        <register caption="Write Protection Mode Register" name="SPI_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="SPI_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="SPI_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x0000FF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="SPI_CSR__BITS">
        <value caption="8 bits for transfer" name="_8_BIT" value="0x0"/>
        <value caption="9 bits for transfer" name="_9_BIT" value="0x1"/>
        <value caption="10 bits for transfer" name="_10_BIT" value="0x2"/>
        <value caption="11 bits for transfer" name="_11_BIT" value="0x3"/>
        <value caption="12 bits for transfer" name="_12_BIT" value="0x4"/>
        <value caption="13 bits for transfer" name="_13_BIT" value="0x5"/>
        <value caption="14 bits for transfer" name="_14_BIT" value="0x6"/>
        <value caption="15 bits for transfer" name="_15_BIT" value="0x7"/>
        <value caption="16 bits for transfer" name="_16_BIT" value="0x8"/>
      </value-group>
      <value-group caption="" name="SPI_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x535049"/>
      </value-group>
    </module>
